In [1]:
import pandas as pd

In [2]:
from io import StringIO

In [3]:
data = '''Sample Animal Intelligence
1 Dog Dumb
2 Dog Dumb
3 Cat    Smart
4 Cat Smart
5 Dog Smart
6 Cat   Smart'''

In [4]:
dframe = pd.read_table(StringIO(data), sep='\s+')

In [5]:
dframe

   Sample Animal Intelligence
0       1    Dog         Dumb
1       2    Dog         Dumb
2       3    Cat        Smart
3       4    Cat        Smart
4       5    Dog        Smart
5       6    Cat        Smart

In [6]:
pd.crosstab(dframe.Animal, dframe.Intelligence)

Intelligence  Dumb  Smart
Animal
Cat              0      3
Dog              2      1

In [7]:
pd.crosstab(dframe.Animal, dframe.Intelligence, margins=True)

Intelligence  Dumb  Smart  All
Animal
Cat              0      3    3
Dog              2      1    3
All              2      4    6